test-sailor.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-04-09 Thu 16:47 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Navigator's Log</title>
<meta name="author" content="Captain Elizabeth Mariner" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/sailor_theme/css/sailor.css"/>
<link rel="stylesheet" href="https://fonts.googleapis.com/css2?family=Merriweather:wght@300;400;500;600;700&family=Nunito:wght@300;400;500;600;700&family=Fira+Code:wght@300;400;500&display=swap"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">The Navigator's Log</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9eebea7">1. 🧭 Today's Voyage</a>
<ul>
<li><a href="#org19b60eb">1.1. [ ] Departure Checklist</a></li>
<li><a href="#orgb5781fe">1.2. [X] Port Preparation</a></li>
</ul>
</li>
<li><a href="#orga69a307">2. 📋 Crew Assignments</a></li>
<li><a href="#org0b8dca6">3. 🗺️ Route Planning</a>
<ul>
<li><a href="#org9f4ccdf">3.1. <span class="todo TODO">TODO</span> Caribbean Passage</a></li>
<li><a href="#org1019a06">3.2. DOING Atlantic Crossing</a></li>
<li><a href="#org4f8b00e">3.3. NA Maintenance Schedule</a></li>
</ul>
</li>
<li><a href="#org0d269b6">4. 🛠️ Vessel Maintenance</a>
<ul>
<li><a href="#orgcd4eb37">4.1. [X] Engine Inspection</a></li>
<li><a href="#orge823ef2">4.2. [X] Hull Inspection</a></li>
<li><a href="#orgb2aff10">4.3. [X] Safety Equipment</a></li>
</ul>
</li>
<li><a href="#org78f36b4">5. 📅 Upcoming Voyages</a></li>
<li><a href="#orgf108466">6. 🧭 Navigation Notes</a></li>
<li><a href="#org3ad0705">7. ⚓ Equipment Inventory</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9eebea7" class="outline-2">
<h2 id="org9eebea7"><span class="section-number-2">1.</span> 🧭 Today's Voyage</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org19b60eb" class="outline-3">
<h3 id="org19b60eb"><span class="section-number-3">1.1.</span> [ ] Departure Checklist</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Check weather forecast</li>
<li class="off"><code>[&#xa0;]</code> Verify compass calibration</li>
<li class="off"><code>[&#xa0;]</code> Inspect vessel systems</li>
<li class="off"><code>[&#xa0;]</code> Brief crew members</li>
</ul>

<blockquote>
<p>
"A smooth sea never made a skilled sailor."
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgb5781fe" class="outline-3">
<h3 id="orgb5781fe"><span class="section-number-3">1.2.</span> [X] Port Preparation</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li class="on"><code>[X]</code> Fuel tanks full ✓</li>
<li class="on"><code>[X]</code> Provisions stocked ✓</li>
<li class="on"><code>[X]</code> Navigation charts updated ✓</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga69a307" class="outline-2">
<h2 id="orga69a307"><span class="section-number-2">2.</span> 📋 Crew Assignments</h2>
<div class="outline-text-2" id="text-2">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Crew Member</th>
<th scope="col" class="org-left">Rank</th>
<th scope="col" class="org-left">Status</th>
<th scope="col" class="org-left">Duty</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">J. Hawkins</td>
<td class="org-left">Captain</td>
<td class="org-left">Active</td>
<td class="org-left">Command</td>
</tr>

<tr>
<td class="org-left">W. Sparrow</td>
<td class="org-left">First Mate</td>
<td class="org-left">Active</td>
<td class="org-left">Navigation</td>
</tr>

<tr>
<td class="org-left">T. Turner</td>
<td class="org-left">Quartermaster</td>
<td class="org-left">Active</td>
<td class="org-left">Supplies</td>
</tr>

<tr>
<td class="org-left">H. Gibbs</td>
<td class="org-left">Navigator</td>
<td class="org-left">Active</td>
<td class="org-left">Charts</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org0b8dca6" class="outline-2">
<h2 id="org0b8dca6"><span class="section-number-2">3.</span> 🗺️ Route Planning</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org9f4ccdf" class="outline-3">
<h3 id="org9f4ccdf"><span class="section-number-3">3.1.</span> <span class="todo TODO">TODO</span> Caribbean Passage</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Plot primary route</li>
<li class="on"><code>[X]</code> Identify safe harbors</li>
<li class="off"><code>[&#xa0;]</code> Check maritime weather patterns</li>
<li class="off"><code>[&#xa0;]</code> File flight plan</li>
</ul>
</div>
</div>
<div id="outline-container-org1019a06" class="outline-3">
<h3 id="org1019a06"><span class="section-number-3">3.2.</span> DOING Atlantic Crossing</h3>
<div class="outline-text-3" id="text-3-2">
</div>
</div>
<div id="outline-container-org4f8b00e" class="outline-3">
<h3 id="org4f8b00e"><span class="section-number-3">3.3.</span> NA Maintenance Schedule</h3>
<div class="outline-text-3" id="text-3-3">
</div>
</div>
</div>
<div id="outline-container-org0d269b6" class="outline-2">
<h2 id="org0d269b6"><span class="section-number-2">4.</span> 🛠️ Vessel Maintenance</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgcd4eb37" class="outline-3">
<h3 id="orgcd4eb37"><span class="section-number-3">4.1.</span> [X] Engine Inspection</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Oil change completed</li>
<li class="on"><code>[X]</code> Filter replacement done</li>
<li class="on"><code>[X]</code> Coolant system checked</li>
</ul>
</div>
</div>
<div id="outline-container-orge823ef2" class="outline-3">
<h3 id="orge823ef2"><span class="section-number-3">4.2.</span> [X] Hull Inspection</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li class="on"><code>[X]</code> No leaks detected</li>
<li class="on"><code>[X]</code> Anti-fouling applied</li>
<li class="on"><code>[X]</code> Propeller clean</li>
</ul>
</div>
</div>
<div id="outline-container-orgb2aff10" class="outline-3">
<h3 id="orgb2aff10"><span class="section-number-3">4.3.</span> [X] Safety Equipment</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li class="on"><code>[X]</code> Life jackets inspected</li>
<li class="on"><code>[X]</code> Fire extinguishers charged</li>
<li class="on"><code>[X]</code> Flares within date</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #d55e00; font-style: italic;"># </span><span style="color: #d55e00; font-style: italic;">Vessel status monitoring
</span><span style="color: #00ff00;">vessel_status</span> = {
    <span style="color: #ff00ff;">'fuel_level'</span>: 85,
    <span style="color: #ff00ff;">'water_level'</span>: 90,
    <span style="color: #ff00ff;">'engine_temp'</span>: <span style="color: #ff00ff;">'normal'</span>,
    <span style="color: #ff00ff;">'speed'</span>: 12.5
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org78f36b4" class="outline-2">
<h2 id="org78f36b4"><span class="section-number-2">5.</span> 📅 Upcoming Voyages</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>TODO Bahamas Expedition |<span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-05 Sun&gt;</span></span></li>
<li>TODO Caribbean Cruise |<span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-15 Wed&gt;</span></span></li>
<li>DOING Atlantic Survey |<span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-22 Wed&gt;</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-orgf108466" class="outline-2">
<h2 id="orgf108466"><span class="section-number-2">6.</span> 🧭 Navigation Notes</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li class="on"><code>[X]</code> Updated nautical charts</li>
<li class="on"><code>[X]</code> Calibrated GPS systems</li>
<li class="off"><code>[&#xa0;]</code> Review tide schedules</li>
<li class="off"><code>[&#xa0;]</code> Check harbor restrictions</li>
</ul>
</div>
</div>
<div id="outline-container-org3ad0705" class="outline-2">
<h2 id="org3ad0705"><span class="section-number-2">7.</span> ⚓ Equipment Inventory</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><b><b>Compass</b></b>: Calibrated and functional</li>
<li><b><b>Binoculars</b></b>: In good condition</li>
<li><b><b>Ropes</b></b>: All secured and inspected</li>
<li><b><b>Sails</b></b>: Clean and ready</li>
</ul>

<blockquote>
<p>
"The sea, once it casts its spell, holds one in its net of wonder forever."
</p>
</blockquote>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-12-19 Thu 00:00</p>
<p class="author">Author: Captain Elizabeth Mariner</p>
<p class="date">Created: 2026-04-09 Thu 16:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
